code/components.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-24 Thu 23:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/rpm.frontend/styles.css"/>
</head>
<body>
<div id="content">

<div id="outline-container-orgdac9ab8" class="outline-2">
<h2 id="orgdac9ab8"><span class="section-number-2">1</span> Layout</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org10d8436" class="outline-3">
<h3 id="org10d8436"><span class="section-number-3">1.1</span> Main header</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #a020f0;">ns</span> <span style="color: #228b22;">app.rpm.components.header</span> <span style="color: #8b2252;">"The main header."</span>)

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">header</span>
  <span style="color: #8b2252;">"The site header."</span>
  []
  (<span style="color: #a020f0;">let</span> [style {
              <span style="color: #008b8b;">:padding</span> 10
              <span style="color: #008b8b;">:background-color</span> <span style="color: #8b2252;">"aliceblue"</span>
              <span style="color: #008b8b;">:text-align</span> <span style="color: #8b2252;">"center"</span>
              }]
    [<span style="color: #008b8b;">:header</span> {<span style="color: #008b8b;">:style</span> style}
    [<span style="color: #008b8b;">:h1</span> <span style="color: #8b2252;">"RPM header"</span>]]))

</pre>
</div>
</div>
</div>

<div id="outline-container-org3aa39ba" class="outline-3">
<h3 id="org3aa39ba"><span class="section-number-3">1.2</span> Main app</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #a020f0;">ns</span> <span style="color: #228b22;">app.rpm.components.app</span> <span style="color: #8b2252;">"The main Reagent app."</span>
  (<span style="color: #008b8b;">:require</span> [app.rpm.components.login <span style="color: #008b8b;">:refer</span> [log-in-form]]))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">A mock app, until we actually implement routing.</span>
(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">router-app</span>
  <span style="color: #8b2252;">"The router app."</span>
  []
  [log-in-form])

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">app</span>
  <span style="color: #8b2252;">"The main Reagent app."</span>
  []
  (<span style="color: #a020f0;">let</span> [style {
              <span style="color: #008b8b;">:background-color</span> <span style="color: #8b2252;">"lightyellow"</span>
              <span style="color: #008b8b;">:padding</span> 20
              <span style="color: #008b8b;">:padding-top</span> 35
              <span style="color: #008b8b;">:padding-bottom</span> 50
              }]
  [<span style="color: #008b8b;">:main</span> {<span style="color: #008b8b;">:style</span> style} [router-app]]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3d3ad6" class="outline-3">
<h3 id="orgf3d3ad6"><span class="section-number-3">1.3</span> Main footer</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #a020f0;">ns</span> <span style="color: #228b22;">app.rpm.components.footer</span> <span style="color: #8b2252;">"The main footer."</span>)

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">footer</span>
  <span style="color: #8b2252;">"The site footer."</span>
  []
  (<span style="color: #a020f0;">let</span> [style {
              <span style="color: #008b8b;">:padding</span> 10
              <span style="color: #008b8b;">:background-color</span> <span style="color: #8b2252;">"lavender"</span>
              <span style="color: #008b8b;">:text-align</span> <span style="color: #8b2252;">"center"</span>
              }]
    [<span style="color: #008b8b;">:footer</span> {<span style="color: #008b8b;">:style</span> style} <span style="color: #8b2252;">"RPM footer"</span>]))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6921d0b" class="outline-2">
<h2 id="org6921d0b"><span class="section-number-2">2</span> Forms</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4e953f3" class="outline-3">
<h3 id="org4e953f3"><span class="section-number-3">2.1</span> The login form</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #a020f0;">ns</span> <span style="color: #228b22;">app.rpm.components.login</span> <span style="color: #8b2252;">"The login component."</span>
  (<span style="color: #008b8b;">:require</span> [app.rpm.helpers.form <span style="color: #008b8b;">:refer</span> [password-field email-field]]))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">on-submit</span>
  <span style="color: #8b2252;">""</span>
  [event]
  (<span style="color: #228b22;">js</span>/console.log <span style="color: #8b2252;">"Submit"</span>))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">log-in-form</span>
  <span style="color: #8b2252;">"..."</span>
  []
  [<span style="color: #008b8b;">:&lt;&gt;</span>
  [<span style="color: #008b8b;">:h1</span> <span style="color: #8b2252;">"Come in please"</span>]
  [<span style="color: #008b8b;">:form</span> {<span style="color: #008b8b;">:on-submit</span> on-submit}
    [email-field {<span style="color: #008b8b;">:placeholder</span> <span style="color: #8b2252;">"you@yourdomain.com"</span>} <span style="color: #8b2252;">"Your e-mail"</span>]
    [password-field <span style="color: #8b2252;">"Your password"</span>]
    [<span style="color: #008b8b;">:div</span> [<span style="color: #008b8b;">:button</span> <span style="color: #8b2252;">"Log me in"</span>]]]])
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2021-06-24 Thu 23:17</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
